/* Завдання 1:*/

// Задание 1:
// Дан массив с элементами 'a', 'b', 'c', 'd', 'e'. С помощью цикла for выведите все эти элементы на экран.

// const letters = ['a', 'b', 'c', 'd', 'e'];

// for (let i = 0; i < letters.length; i++) {

//     document.write(letters[i] + ' ');
// }

/* Завдання 1:*/
/* Завдання 2:*/

// Задание 2:
// Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла for и оператора if выведите в консоль нечетные элементы массива.

// let arr = [1, 2, 3, 4, 5];

// for (let i = 0; i < arr.length; i++) {
// 	if (arr[i] % 2 - 1 == 0) {
// 		console.log(arr[i]);
// 	}
// }

/* Завдання 2:*/
/* Завдання 3:*/

// Задание 3:
// Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла for найдите произведение элементов этого массива.

// let mult = 1;

// for (let i = 1; i <= 5; i++){
//     mult = mult * i;
// }

// console.log(mult);

/* Завдання 3:*/
/* Завдання 4:*/

// Задание 4:
// Дан массив с элементами 2, 5, 9, 15, 1, 4. С помощью цикла for и оператора if выведите в консоль те элементы массива, которые больше 3-х, но меньше 10.

// let arr = [2, 5, 9, 15, 0, 4];

// for (let i = 0; i < arr.length; i++) {

// if (arr[i] > 3 && arr[i] < 10) document.write(arr[i]+'<br>');
// }

/* Завдання 4:*/
/* Завдання 5:*/

// Задание 5:
// Дан массив arr (заполните любыми значениями). Найдите среднее арифметическое его элементов (сумма делить на количество). 

// let arr = [3, 6, 13, 21, 53, 46, 77, 82, 95];

// let sum = 0;

// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i];
// }

// let result = sum / arr.length;
// document.write (sum);
// document.write ('<br>');
// document.write (result);

/* Завдання 5:*/
/* Завдання 6:*/

// Задание 6:
// Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.



/* Завдання 6:*/
/* Завдання 7:*/

// Задание 7:
// Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.



/* Завдання 7:*/
/* Завдання 8:*/

// Задание 8:
// Напишите функцию removeDuplicates(arr), которая возвращает массив, в котором удалены повторяющиеся элементы из массива arr (игнорируйте чувствительность к регистру).



/* Завдання 8:*/
/* Завдання 9:*/

// Задание 9:
// Напишите функцию countIdentic(arr), которая возвращает количество повторяющихся элементов в массиве.



/* Завдання 9:*/
/* Завдання 10:*/

// Задание 10:
// Найдите минимальный и максимальный элемент в массиве.

/* Завдання 10:*/